import { GAME_KIND } from "..";

export const GAME_KIND_DESC = {
    [GAME_KIND.TWO_FACE]: "两面",
    [GAME_KIND.GROUP_RULE]: "组合",
    [GAME_KIND.SELECT_POS]: "投壶",
    [GAME_KIND.UNDERWEAR_COLOR]: "猜衣色",
};

export const TWO_FACE_VALUE_DESC = {
    s: "更衣",
    b: "喝酒",
};

export const GROUP_RULE_TYPE_DESC = {
    1: "五位全脱",
    2: "四位脱衣，一位喝酒",
    3: "三位脱衣，二位喝酒",
    4: "二位脱衣，三位喝酒",
    5: "一位脱衣，四位喝酒",
    6: "五位全喝",
};

export const UNDERWEAR_VALUE_DESC = {
    ur: "红内衣",
    ub: "蓝内衣",
    uw: "白内衣",
};

export const RULE_DICTIONARY = [
    {
        title: "两面玩法",
        desc: "开奖号码分为五位,各位号码范围为0～9,奖号0,1,2,3,4金钗脱衣,奖号5,6,7,8,9金钗喝酒。",
    },
    {
        title: "组合",
        desc: "各金钗分为喝酒或脱衣,玩家竞猜五位金钗脱衣喝酒分布情形。举例：开奖号2,5,7,9,5,则选一位脱衣,四位喝酒中奖。",
    },
    {
        title: "投壶_选一位",
        desc:
            "任选1个位置并选1个号码组成1注,所选1个位置上的开奖号与所选号码相同,且位置一致,即中投一中一獎。举例：开奖号2,5,7,9,5,则2****中投一中一奖。",
    },
    {
        title: "投壶_选两位",
        desc:
            "任选2个位置并各选1个号码组成兩注,所选2个位置上的开奖号与全部所选号码相同,且顺序一致,即中投二中二獎,中其一則為投二中一獎。举例：开奖号2,5,7,9,5,则2*7**中投二中二奖,2****或**7**中投二中一獎。",
    },
    {
        title: "投壶_选三位",
        desc:
            "任选3个位置并各选1个号码组成三注,分別為投三中三獎,投三中二獎,投三中一獎。<br />所选3个位置上的开奖号与全部所选号码相同,且顺序一致,即为中投三中三奖。举例：开奖号2,5,7,9,5,则2*79*中奖。<br />所选3个位置上的开奖号与全部所选号码两个相同,且位置一致,即为中投三中二奖。举例：开奖号2,5,7,9,5,则2*73*中投三中二奖。<br />所选3个位置上的开奖号与全部所选号码一个相同,且位置一致,即为中投三中一奖。举例：开奖号2,5,7,9,5,则2*45*中投三中一奖。",
    },
    {
        title: "投壶_选四位",
        desc:
            "任选4个位置并各选1个号码组成四注,分別為投四中四獎,投四中三獎,投四中二獎,投四中一獎。<br />投所选4个位置上的开奖号与全部所选号码相同,且位置一致,即为中投四中四奖。举例：开奖号2,5,7,9,5,则2*795中奖。<br />投所选4个位置上的开奖号与全部所选号码三个相同,且位置一致,即为中投四中三奖。举例：开奖号2,5,7,9,5,则2*395中奖。<br />投所选4个位置上的开奖号与全部所选号码二个相同,且位置一致,即为中投四中二奖。举例：开奖号2,5,7,9,5,则2*345中奖。<br />投所选4个位置上的开奖号与全部所选号码一个相同,且位置一致,即为中投四中一奖。举例：开奖号2,5,7,9,5,则1*345中奖。",
    },
    {
        title: "投壶_选五位",
        desc:
            "5个位置各选1个号码组成五注,分別為投五中五獎,投五中四獎,投五中三獎,投五中二獎,投五中一獎。<br />所选5个位置上的开奖号与全部所选号码相同,且顺序一致,即为中投五中五奖。举例：开奖号2,5,7,9,5,则25795中投五中五奖。<br />所选5个位置上的开奖号与全部所选号码四个相同,且位置一致,即为中投五中四奖。举例：开奖号2,5,7,9,5,则25791中投五中四奖。<br />所选5个位置上的开奖号与全部所选号码三个相同,且位置一致,即为中投五中三奖。举例：开奖号2,5,7,9,5,则25721中投五中三奖。<br />所选5个位置上的开奖号与全部所选号码二个相同,且位置一致,即为中投五中二奖。举例：开奖号2,5,7,9,5,则25321中投五中二奖。<br />所选5个位置上的开奖号与全部所选号码一个相同,且位置一致,即为中投五中一奖。举例：开奖号2,5,7,9,5,则24321中投五中一奖。",
    },
    {
        title: "猜衣色",
        desc:
            "开奖号码分为五位,各位号码范围为0～9,奖号0,3,6,9金钗穿红内衣,奖号1,4,7金钗穿蓝内衣,奖号2,5,8金钗穿白内衣。举例：开奖号2,5,7,9,5,则潘金莲-白内衣中奖。",
    },
];
